MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32U083KC/mcu.h
/********************  Bit definition for RCC_APB1ENR register  ***************/
#define RCC_APBENR1_TIM2EN_Pos         (0U)
#define RCC_APBENR1_TIM2EN_Msk         (0x1UL << RCC_APBENR1_TIM2EN_Pos)       /*!< 0x00000001 */
#define RCC_APBENR1_TIM2EN             RCC_APBENR1_TIM2EN_Msk
#define RCC_APBENR1_TIM3EN_Pos         (1U)
#define RCC_APBENR1_TIM3EN_Msk         (0x1UL << RCC_APBENR1_TIM3EN_Pos)       /*!< 0x00000002 */
#define RCC_APBENR1_TIM3EN             RCC_APBENR1_TIM3EN_Msk
#define RCC_APBENR1_TIM6EN_Pos         (4U)
#define RCC_APBENR1_TIM6EN_Msk         (0x1UL << RCC_APBENR1_TIM6EN_Pos)       /*!< 0x00000010 */
#define RCC_APBENR1_TIM6EN             RCC_APBENR1_TIM6EN_Msk
#define RCC_APBENR1_TIM7EN_Pos         (5U)
#define RCC_APBENR1_TIM7EN_Msk         (0x1UL << RCC_APBENR1_TIM7EN_Pos)       /*!< 0x00000020 */
#define RCC_APBENR1_TIM7EN             RCC_APBENR1_TIM7EN_Msk
#define RCC_APBENR1_LPUART2EN_Pos      (7U)
#define RCC_APBENR1_LPUART2EN_Msk      (0x1UL << RCC_APBENR1_LPUART2EN_Pos)    /*!< 0x00000080 */
#define RCC_APBENR1_LPUART2EN          RCC_APBENR1_LPUART2EN_Msk
#define RCC_APBENR1_LCDEN_Pos          (9U)
#define RCC_APBENR1_LCDEN_Msk          (0x1UL << RCC_APBENR1_LCDEN_Pos)        /*!< 0x00000200 */
#define RCC_APBENR1_LCDEN              RCC_APBENR1_LCDEN_Msk
#define RCC_APBENR1_RTCAPBEN_Pos       (10U)
#define RCC_APBENR1_RTCAPBEN_Msk       (0x1UL << RCC_APBENR1_RTCAPBEN_Pos)     /*!< 0x00000400 */
#define RCC_APBENR1_RTCAPBEN           RCC_APBENR1_RTCAPBEN_Msk
#define RCC_APBENR1_WWDGEN_Pos         (11U)
#define RCC_APBENR1_WWDGEN_Msk         (0x1UL << RCC_APBENR1_WWDGEN_Pos)       /*!< 0x00000800 */
#define RCC_APBENR1_WWDGEN             RCC_APBENR1_WWDGEN_Msk
#define RCC_APBENR1_LPUART3EN_Pos      (12U)
#define RCC_APBENR1_LPUART3EN_Msk      (0x1UL << RCC_APBENR1_LPUART3EN_Pos)    /*!< 0x00001000 */
#define RCC_APBENR1_LPUART3EN          RCC_APBENR1_LPUART3EN_Msk
#define RCC_APBENR1_USBEN_Pos          (13U)
#define RCC_APBENR1_USBEN_Msk          (0x1UL << RCC_APBENR1_USBEN_Pos)        /*!< 0x00002000 */
#define RCC_APBENR1_USBEN              RCC_APBENR1_USBEN_Msk
#define RCC_APBENR1_SPI2EN_Pos         (14U)
#define RCC_APBENR1_SPI2EN_Msk         (0x1UL << RCC_APBENR1_SPI2EN_Pos)       /*!< 0x00004000 */
#define RCC_APBENR1_SPI2EN             RCC_APBENR1_SPI2EN_Msk
#define RCC_APBENR1_SPI3EN_Pos         (15U)
#define RCC_APBENR1_SPI3EN_Msk         (0x1UL << RCC_APBENR1_SPI3EN_Pos)       /*!< 0x00008000 */
#define RCC_APBENR1_SPI3EN             RCC_APBENR1_SPI3EN_Msk
#define RCC_APBENR1_CRSEN_Pos          (16U)
#define RCC_APBENR1_CRSEN_Msk          (0x1UL << RCC_APBENR1_CRSEN_Pos)        /*!< 0x00010000 */
#define RCC_APBENR1_CRSEN              RCC_APBENR1_CRSEN_Msk
#define RCC_APBENR1_USART2EN_Pos       (17U)
#define RCC_APBENR1_USART2EN_Msk       (0x1UL << RCC_APBENR1_USART2EN_Pos)     /*!< 0x00020000 */
#define RCC_APBENR1_USART2EN           RCC_APBENR1_USART2EN_Msk
#define RCC_APBENR1_USART3EN_Pos       (18U)
#define RCC_APBENR1_USART3EN_Msk       (0x1UL << RCC_APBENR1_USART3EN_Pos)     /*!< 0x00040000 */
#define RCC_APBENR1_USART3EN           RCC_APBENR1_USART3EN_Msk
#define RCC_APBENR1_USART4EN_Pos       (19U)
#define RCC_APBENR1_USART4EN_Msk       (0x1UL << RCC_APBENR1_USART4EN_Pos)     /*!< 0x00080000 */
#define RCC_APBENR1_USART4EN           RCC_APBENR1_USART4EN_Msk
#define RCC_APBENR1_LPUART1EN_Pos      (20U)
#define RCC_APBENR1_LPUART1EN_Msk      (0x1UL << RCC_APBENR1_LPUART1EN_Pos)    /*!< 0x00010000 */
#define RCC_APBENR1_LPUART1EN          RCC_APBENR1_LPUART1EN_Msk
#define RCC_APBENR1_I2C1EN_Pos         (21U)
#define RCC_APBENR1_I2C1EN_Msk         (0x1UL << RCC_APBENR1_I2C1EN_Pos)       /*!< 0x00200000 */
#define RCC_APBENR1_I2C1EN             RCC_APBENR1_I2C1EN_Msk
#define RCC_APBENR1_I2C2EN_Pos         (22U)
#define RCC_APBENR1_I2C2EN_Msk         (0x1UL << RCC_APBENR1_I2C2EN_Pos)       /*!< 0x00400000 */
#define RCC_APBENR1_I2C2EN             RCC_APBENR1_I2C2EN_Msk
#define RCC_APBENR1_I2C3EN_Pos         (23U)
#define RCC_APBENR1_I2C3EN_Msk         (0x1UL << RCC_APBENR1_I2C3EN_Pos)       /*!< 0x00800000 */
#define RCC_APBENR1_I2C3EN             RCC_APBENR1_I2C3EN_Msk
#define RCC_APBENR1_OPAMPEN_Pos        (24U)
#define RCC_APBENR1_OPAMPEN_Msk        (0x1UL << RCC_APBENR1_OPAMPEN_Pos)      /*!< 0x01000000 */
#define RCC_APBENR1_OPAMPEN            RCC_APBENR1_OPAMPEN_Msk
#define RCC_APBENR1_I2C4EN_Pos         (25U)
#define RCC_APBENR1_I2C4EN_Msk         (0x1UL << RCC_APBENR1_I2C4EN_Pos)       /*!< 0x02000000 */
#define RCC_APBENR1_I2C4EN             RCC_APBENR1_I2C4EN_Msk
#define RCC_APBENR1_LPTIM3EN_Pos       (26U)
#define RCC_APBENR1_LPTIM3EN_Msk       (0x1UL << RCC_APBENR1_LPTIM3EN_Pos)     /*!< 0x04000000 */
#define RCC_APBENR1_LPTIM3EN           RCC_APBENR1_LPTIM3EN_Msk
#define RCC_APBENR1_PWREN_Pos          (28U)
#define RCC_APBENR1_PWREN_Msk          (0x1UL << RCC_APBENR1_PWREN_Pos)        /*!< 0x10000000 */
#define RCC_APBENR1_PWREN              RCC_APBENR1_PWREN_Msk
#define RCC_APBENR1_DAC1EN_Pos         (29U)
#define RCC_APBENR1_DAC1EN_Msk         (0x1UL << RCC_APBENR1_DAC1EN_Pos)       /*!< 0x20000000 */
#define RCC_APBENR1_DAC1EN             RCC_APBENR1_DAC1EN_Msk
#define RCC_APBENR1_LPTIM2EN_Pos       (30U)
#define RCC_APBENR1_LPTIM2EN_Msk       (0x1UL << RCC_APBENR1_LPTIM2EN_Pos)     /*!< 0x40000000 */
#define RCC_APBENR1_LPTIM2EN           RCC_APBENR1_LPTIM2EN_Msk
#define RCC_APBENR1_LPTIM1EN_Pos       (31U)
#define RCC_APBENR1_LPTIM1EN_Msk       (0x1UL << RCC_APBENR1_LPTIM1EN_Pos)     /*!< 0x80000000 */
#define RCC_APBENR1_LPTIM1EN           RCC_APBENR1_LPTIM1EN_Msk

/********************  Bit definition for RCC_APB2ENR register  **************/
#define RCC_APBENR2_SYSCFGEN_Pos       (0U)
#define RCC_APBENR2_SYSCFGEN_Msk       (0x1UL << RCC_APBENR2_SYSCFGEN_Pos)     /*!< 0x00000001 */
#define RCC_APBENR2_SYSCFGEN           RCC_APBENR2_SYSCFGEN_Msk
#define RCC_APBENR2_TIM1EN_Pos         (11U)
#define RCC_APBENR2_TIM1EN_Msk         (0x1UL << RCC_APBENR2_TIM1EN_Pos)       /*!< 0x00000800 */
#define RCC_APBENR2_TIM1EN             RCC_APBENR2_TIM1EN_Msk
#define RCC_APBENR2_SPI1EN_Pos         (12U)
#define RCC_APBENR2_SPI1EN_Msk         (0x1UL << RCC_APBENR2_SPI1EN_Pos)       /*!< 0x00001000 */
#define RCC_APBENR2_SPI1EN             RCC_APBENR2_SPI1EN_Msk
#define RCC_APBENR2_USART1EN_Pos       (14U)
#define RCC_APBENR2_USART1EN_Msk       (0x1UL << RCC_APBENR2_USART1EN_Pos)     /*!< 0x00004000 */
#define RCC_APBENR2_USART1EN           RCC_APBENR2_USART1EN_Msk
#define RCC_APBENR2_TIM15EN_Pos        (16U)
#define RCC_APBENR2_TIM15EN_Msk        (0x1UL << RCC_APBENR2_TIM15EN_Pos)      /*!< 0x00008000 */
#define RCC_APBENR2_TIM15EN            RCC_APBENR2_TIM15EN_Msk
#define RCC_APBENR2_TIM16EN_Pos        (17U)
#define RCC_APBENR2_TIM16EN_Msk        (0x1UL << RCC_APBENR2_TIM16EN_Pos)      /*!< 0x00020000 */
#define RCC_APBENR2_TIM16EN            RCC_APBENR2_TIM16EN_Msk
#define RCC_APBENR2_ADCEN_Pos          (20U)
#define RCC_APBENR2_ADCEN_Msk          (0x1UL << RCC_APBENR2_ADCEN_Pos)        /*!< 0x00100000 */
#define RCC_APBENR2_ADCEN              RCC_APBENR2_ADCEN_Msk

/********************  Bit definition for RCC_AHBSMENR register  *************/
#define RCC_AHBSMENR_DMA1SMEN_Pos      (0U)
#define RCC_AHBSMENR_DMA1SMEN_Msk      (0x1UL << RCC_AHBSMENR_DMA1SMEN_Pos)    /*!< 0x00000001 */
#define RCC_AHBSMENR_DMA1SMEN          RCC_AHBSMENR_DMA1SMEN_Msk
#define RCC_AHBSMENR_DMA2SMEN_Pos      (1U)
#define RCC_AHBSMENR_DMA2SMEN_Msk      (0x1UL << RCC_AHBSMENR_DMA2SMEN_Pos)    /*!< 0x00000002 */
#define RCC_AHBSMENR_DMA2SMEN          RCC_AHBSMENR_DMA2SMEN_Msk
#define RCC_AHBSMENR_FLASHSMEN_Pos     (8U)
#define RCC_AHBSMENR_FLASHSMEN_Msk     (0x1UL << RCC_AHBSMENR_FLASHSMEN_Pos)   /*!< 0x00000100 */
#define RCC_AHBSMENR_FLASHSMEN         RCC_AHBSMENR_FLASHSMEN_Msk
#define RCC_AHBSMENR_SRAM1SMEN_Pos     (9U)
#define RCC_AHBSMENR_SRAM1SMEN_Msk     (0x1UL << RCC_AHBSMENR_SRAM1SMEN_Pos)   /*!< 0x00000200 */
#define RCC_AHBSMENR_SRAM1SMEN         RCC_AHBSMENR_SRAM1SMEN_Msk
#define RCC_AHBSMENR_CRCSMEN_Pos       (12U)
#define RCC_AHBSMENR_CRCSMEN_Msk       (0x1UL << RCC_AHBSMENR_CRCSMEN_Pos)     /*!< 0x00001000 */
#define RCC_AHBSMENR_CRCSMEN           RCC_AHBSMENR_CRCSMEN_Msk
#define RCC_AHBSMENR_AESSMEN_Pos       (16U)
#define RCC_AHBSMENR_AESSMEN_Msk       (0x1UL << RCC_AHBSMENR_AESSMEN_Pos)     /*!< 0x00010000 */
#define RCC_AHBSMENR_AESSMEN           RCC_AHBSMENR_AESSMEN_Msk
#define RCC_AHBSMENR_RNGSMEN_Pos       (18U)
#define RCC_AHBSMENR_RNGSMEN_Msk       (0x1UL << RCC_AHBSMENR_RNGSMEN_Pos)     /*!< 0x00040000 */
#define RCC_AHBSMENR_RNGSMEN           RCC_AHBSMENR_RNGSMEN_Msk
#define RCC_AHBSMENR_TSCSMEN_Pos       (24U)
#define RCC_AHBSMENR_TSCSMEN_Msk       (0x1UL << RCC_AHBSMENR_TSCSMEN_Pos)     /*!< 0x01000000 */
#define RCC_AHBSMENR_TSCSMEN           RCC_AHBSMENR_TSCSMEN_Msk

